stress-test.jmx
<?xml version="1.0" encoding="UTF-8"?>
<jmeterTestPlan version="1.2" properties="5.0" jmeter="5.5">
  <hashTree>
    <TestPlan guiclass="TestPlanGui" testclass="TestPlan" testname="Test Plan" enabled="true">
      <boolProp name="TestPlan.functional_mode">false</boolProp>
      <boolProp name="TestPlan.tearDown_on_shutdown">true</boolProp>
      <boolProp name="TestPlan.serialize_threadgroups">false</boolProp>
      <elementProp name="TestPlan.user_defined_variables" elementType="Arguments" guiclass="ArgumentsPanel" testclass="Arguments" testname="User Defined Variables" enabled="true">
        <collectionProp name="Arguments.arguments"/>
      </elementProp>
    </TestPlan>
    <hashTree>
      <HeaderManager guiclass="HeaderPanel" testclass="HeaderManager" testname="HTTP Header Manager" enabled="true">
        <collectionProp name="HeaderManager.headers">
          <elementProp name="" elementType="Header">
            <stringProp name="Header.name">Content-Type</stringProp>
            <stringProp name="Header.value">application/json</stringProp>
          </elementProp>
        </collectionProp>
      </HeaderManager>
      <hashTree/>
      <ThreadGroup guiclass="ThreadGroupGui" testclass="ThreadGroup" testname="stress-test" enabled="true">
        <stringProp name="ThreadGroup.on_sample_error">continue</stringProp>
        <elementProp name="ThreadGroup.main_controller" elementType="LoopController" guiclass="LoopControlPanel" testclass="LoopController" testname="Loop Controller" enabled="true">
          <boolProp name="LoopController.continue_forever">false</boolProp>
          <stringProp name="LoopController.loops">1</stringProp>
        </elementProp>
        <stringProp name="ThreadGroup.num_threads">10</stringProp>
        <stringProp name="ThreadGroup.ramp_time">10</stringProp>
        <boolProp name="ThreadGroup.scheduler">false</boolProp>
        <boolProp name="ThreadGroup.same_user_on_next_iteration">true</boolProp>
      </ThreadGroup>
      <hashTree>
        <HTTPSamplerProxy guiclass="HttpTestSampleGui" testclass="HTTPSamplerProxy" testname="HTTP Request" enabled="true">
          <boolProp name="HTTPSampler.postBodyRaw">true</boolProp>
          <elementProp name="HTTPsampler.Arguments" elementType="Arguments">
            <collectionProp name="Arguments.arguments">
              <elementProp name="" elementType="HTTPArgument">
                <boolProp name="HTTPArgument.always_encode">false</boolProp>
                <stringProp name="Argument.value">{&#xd;
	&quot;array&quot;: [847, 359, 790, 698, 242, 114, 706, 496, 468, 381, 5, 431, 14, 673, 809, 680, 74, 662, 763, 968, 278, 538, 238, 274, 948, 333, 322, 831, 84, 534, 52, 709, 884, 175, 689, 290, 781, 287, 555, 14, 639, 482, 939, 692, 262, 626, 6, 582, 680, 309, 348, 929, 140, 292, 832, 690, 885, 941, 431, 720, 295, 446, 685, 566, 437, 728, 612, 683, 81, 138, 234, 710, 57, 754, 946, 227, 706, 88, 590, 129, 67, 803, 806, 227, 535, 513, 243, 462, 769, 456, 261, 160, 69, 872, 807, 287, 625, 800, 348, 445, 155, 304, 702, 136, 665, 898, 870, 42, 213, 848, 479, 814, 793, 614, 813, 638, 771, 706, 59, 619, 132, 98, 268, 509, 389, 141, 842, 914, 425, 353, 214, 19, 697, 629, 571, 686, 701, 115, 601, 338, 834, 240, 21, 469, 510, 304, 603, 50, 213, 954, 527, 853, 862, 385, 510, 762, 571, 973, 760, 748, 835, 964, 212, 640, 360, 94, 615, 99, 140, 70, 529, 925, 358, 846, 457, 192, 493, 496, 145, 663, 912, 815, 86, 424, 771, 91, 33, 291, 839, 341, 846, 775, 857, 431, 137, 302, 872, 731, 493, 658, 507, 215, 606, 253, 551, 845, 416, 698, 834, 275, 685, 555, 220, 991, 535, 187, 490, 218, 826, 876, 53, 683, 312, 180, 656, 490, 904, 67, 100, 711, 95, 325, 53, 48, 507, 413, 553, 99, 392, 653, 415, 619, 591, 480, 211, 762, 715, 241, 609, 514, 583, 248, 390, 448, 404, 700, 720, 496, 883, 180, 438, 375, 675, 519, 440, 746, 172, 612, 303, 885, 30, 380, 563, 694, 516, 878, 316, 915, 120, 523, 620, 274, 484, 209, 812, 604, 443, 754, 879, 326, 169, 159, 169, 299, 247, 532, 838, 740, 914, 81, 475, 610, 631, 737, 520, 81, 918, 938, 958, 665, 789, 81, 553, 879, 750, 948, 824, 709, 893, 503, 213, 812, 772, 592, 755, 633, 640, 268, 66, 887, 211, 74, 326, 142, 366, 740, 631, 84, 965, 83, 283, 312, 836, 708, 14, 583, 344, 541, 701, 878, 645, 428, 327, 733, 859, 812, 919, 240, 446, 380, 305, 939, 519, 62, 525, 478, 718, 947, 487, 85, 517, 481, 800, 899, 265, 612, 271, 424, 391, 733, 850, 617, 625, 750, 129, 250, 32, 152, 616, 799, 82, 290, 549, 715, 584, 8, 236, 735, 641, 30, 47, 585, 472, 691, 937, 451, 52, 693, 472, 739, 258, 841, 105, 915, 653, 637, 193, 601, 160, 615, 728, 669, 579, 517, 989, 448, 662, 364, 186, 527, 348, 919, 697, 101, 122, 918, 68, 341, 815, 64, 979, 497, 109, 870, 162, 970, 744, 593, 667, 432, 977, 53, 627, 340, 992, 20, 88, 604, 536, 220, 1, 598, 913, 898, 584, 511, 155, 32, 903, 439, 746, 733, 494, 801, 773, 714, 236, 494, 941, 685, 525, 691, 602, 724, 964, 328, 158, 400, 171, 474, 399, 809, 870, 439, 711, 55, 77, 458, 771, 733, 618, 73, 433, 353, 190, 361, 524, 517, 787, 265, 9, 163, 793, 166, 60, 390, 470, 429, 373, 222, 871, 90, 535, 535, 327, 142, 932, 904, 298, 885, 927, 165, 922, 875, 205, 169, 283, 531, 915, 452, 543, 344, 343, 446, 893, 732, 36, 327, 2, 917, 488, 363, 418, 730, 577, 776, 142, 55, 688, 14, 583, 973, 521, 136, 37, 560, 25, 820, 748, 949, 66, 317, 186, 67, 255, 558, 203, 987, 320, 421, 758, 597, 554, 760, 480, 565, 632, 357, 525, 660, 544, 425, 622, 825, 941, 533, 946, 57, 684, 298, 765, 996, 920, 192, 668, 168, 682, 955, 18, 102, 334, 225, 900, 541, 995, 833, 279, 569, 567, 536, 80, 35, 706, 303, 407, 188, 262, 58, 312, 221, 396, 479, 748, 722, 528, 119, 364, 387, 843, 469, 49, 757, 406, 733, 703, 168, 333, 379, 692, 182, 288, 781, 393, 29, 811, 427, 103, 481, 688, 470, 648, 938, 148, 135, 472, 570, 679, 377, 908, 611, 179, 621, 955, 816, 695, 717, 324, 872, 330, 358, 535, 266, 277, 715, 462, 924, 637, 275, 890, 365, 881, 585, 874, 244, 279, 680, 382, 909, 840, 310, 921, 930, 582, 770, 869, 113, 203, 49, 385, 537, 919, 453, 516, 190, 195, 935, 39, 930, 835, 25, 120, 644, 414, 144, 478, 513, 644, 130, 461, 554, 318, 593, 255, 280, 405, 496, 596, 862, 827, 168, 188, 969, 916, 648, 283, 71, 954, 121, 177, 571, 798, 55, 610, 520, 162, 375, 518, 177, 836, 342, 344, 397, 30, 5, 298, 726, 662, 141, 907, 853, 786, 111, 438, 784, 9, 33, 455, 259, 639, 297, 32, 840, 162, 62, 561, 943, 737, 63, 580, 438, 971, 830, 783, 197, 642, 326, 156, 352, 667, 42, 129, 882, 253, 648, 59, 178, 558, 76, 437, 560, 341, 785, 886, 327, 425, 933, 389, 26, 174, 82, 853, 518, 884, 590, 34, 842, 162, 301, 426, 389, 492, 180, 986, 752, 397, 932, 481, 208, 22, 166, 941, 361, 457, 885, 263, 685, 568, 422, 74, 112, 840, 566, 461, 286, 528, 441, 347, 817, 229, 993, 713, 384, 473, 716, 700, 116, 95, 418, 223, 865, 707, 81, 621, 440, 394, 522, 113, 167, 933, 508, 284, 368, 323, 29, 384, 544, 941, 143, 647, 288, 989, 393, 158, 208, 709, 468, 317, 967, 182, 843, 261, 277, 535, 573, 388, 102, 119, 300, 39, 696, 93, 511, 256, 210, 122, 158, 69, 599, 600, 382, 144, 595, 572, 984, 392, 698, 404, 905, 866, 474, 438, 445, 913, 387, 820, 814, 851, 394, 784, 105, 396, 748, 362, 35, 953, 291, 487, 598, 895, 197, 878, 205, 631, 177, 335, 285, 625, 874, 716, 529, 513, 622, 968, 330, 455, 896, 233, 691, 290, 555, 534, 334, 449, 628, 466, 202, 431, 853, 767, 98, 904, 946, 95, 111, 849, 858, 91, 991, 343, 573, 545, 471, 270, 195, 330, 137, 360, 100, 725, 466]	&#xd;
}</stringProp>
                <stringProp name="Argument.metadata">=</stringProp>
              </elementProp>
            </collectionProp>
          </elementProp>
          <stringProp name="HTTPSampler.domain">18.228.222.129</stringProp>
          <stringProp name="HTTPSampler.port">8080</stringProp>
          <stringProp name="HTTPSampler.path">/</stringProp>
          <stringProp name="HTTPSampler.method">POST</stringProp>
          <boolProp name="HTTPSampler.follow_redirects">true</boolProp>
          <boolProp name="HTTPSampler.auto_redirects">false</boolProp>
          <boolProp name="HTTPSampler.use_keepalive">true</boolProp>
          <boolProp name="HTTPSampler.DO_MULTIPART_POST">false</boolProp>
        </HTTPSamplerProxy>
        <hashTree/>
      </hashTree>
      <ResultCollector guiclass="ViewResultsFullVisualizer" testclass="ResultCollector" testname="View Results Tree" enabled="true">
        <boolProp name="ResultCollector.error_logging">false</boolProp>
      </ResultCollector>
      <hashTree/>
      <ResultCollector guiclass="TableVisualizer" testclass="ResultCollector" testname="View Results in Table" enabled="true">
        <boolProp name="ResultCollector.error_logging">false</boolProp>
      </ResultCollector>
      <hashTree/>
      <ResultCollector guiclass="StatVisualizer" testclass="ResultCollector" testname="Aggregate Report" enabled="true">
        <boolProp name="ResultCollector.error_logging">false</boolProp>
      </ResultCollector>
      <hashTree/>
    </hashTree>
  </hashTree>
</jmeterTestPlan>